app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
      puts user_params
    @user.save
---
INSERT INTO "users" ("firstname", "lastname", "email", "dob", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"